app/controllers/places_controller.rb

  def index
    if params.has_key? :busca
      @centros = Place.where("nombre LIKE ?", params[:busca])
    else
      @centros = Place.all
---
SELECT "places".* FROM "places"

  def lugares
    @lat = params[:latitude]
    @lon = params[:longitude]
    if params.has_key? :busca
      puts "yaay"
      @centros = Place.near([@lat, @lon], 2).where("nombre LIKE ?", params[:busca])
---
SELECT places.*, (69.09332411348201 * ABS(places.latitude - 19.4223918) * 0.7071067811865475) + (59.836573914187355 * ABS(places.longitude - -99.1338183) * 0.7071067811865475) AS distance, CASE WHEN (places.latitude >= 19.4223918 AND places.longitude >= -99.1338183) THEN 45.0 WHEN (places.latitude < 19.4223918 AND places.longitude >= -99.1338183) THEN 135.0 WHEN (places.latitude < 19.4223918 AND places.longitude < -99.1338183) THEN 225.0 WHEN (places.latitude >= 19.4223918 AND places.longitude < -99.1338183) THEN 315.0 END AS bearing FROM "places" WHERE (places.latitude BETWEEN 19.39344544337783 AND 19.45133815662217 AND places.longitude BETWEEN -99.16451131072577 AND -99.10312528927423) ORDER BY distance ASC